## Staging: api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
```terraform
Plan: 1 to add, 2 to change, 0 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies"  {
      ~ id      = "3361112219" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:127893201980:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-staging-file-queue/*",
                          - "arn:aws:s3:::scan-files-staging-file-queue",
                          - "arn:aws:s3:::scan-files-staging-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-staging-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:127893201980:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:127893201980:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:127893201980:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:127893201980:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:127893201980:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:127893201980:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:ssm:ca-central-1:127893201980:parameter/ENVIRONMENT_VARIABLES",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_ssm_parameter.api_secret_environment_variables will be created
  + resource "aws_ssm_parameter" "api_secret_environment_variables" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "ENVIRONMENT_VARIABLES"
      + tags      = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCentre" = "scan-files-staging"
          + "Terraform"  = "true"
        }
      + tier      = (known after apply)
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # module.api.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::127893201980:policy/scan-files-api-0"
        name      = "scan-files-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:127893201980:log-group:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:Put*",
                          - "s3:ListBucketVersions",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::scan-files-staging-file-queue/*",
                          - "arn:aws:s3:::scan-files-staging-file-queue",
                          - "arn:aws:s3:::scan-files-staging-clamav-defs/*",
                          - "arn:aws:s3:::scan-files-staging-clamav-defs",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "states:StopExecution",
                          - "states:ListStateMachines",
                          - "states:ListActivities",
                          - "states:DescribeExecution",
                          - "states:CreateActivity",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:127893201980:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:ca-central-1:127893201980:stateMachine:assemblyline-file-scan-queue"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "events:PutTargets",
                          - "events:PutRule",
                          - "events:DescribeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ca-central-1:127893201980:rule/StepFunctionsGetEventsForStepFunctionsExecutionRule"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:127893201980:table/scan-locktable",
                          - "arn:aws:dynamodb:ca-central-1:127893201980:table/completed-scans",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:127893201980:parameter/ENVIRONMENT_VARIABLES"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:127893201980:function:scan-files-api"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.api.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "scan-files-api"
        tags                           = {
            "CostCentre" = "scan-files-staging"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "AV_DEFINITION_S3_BUCKET"      = "scan-files-staging-clamav-defs"
              + "COMPLETED_SCANS_TABLE_NAME"   = "completed-scans"
              + "FILE_CHECKSUM_TABLE_NAME"     = "file-checksums"
              + "OPENAPI_URL"                  = "/openapi.json"
              + "SCAN_QUEUE_STATEMACHINE_NAME" = "assemblyline-file-scan-queue"
                # (4 unchanged elements hidden)
            }
        }



        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.clamav-defs.aws_s3_bucket.this,
  on .terraform/modules/clamav-defs/S3/main.tf line 7, in resource "aws_s3_bucket" "this":
   7: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
